<template>
<div class="instruction">
  <div class="container">
    <h1>Инструкция</h1>
  <section>
    <h2>
      Контекстное меню
    </h2>
    <ol>
      <li>
        <p><strong>Контекстное меню</strong> - интерфейс управление состоянием приложения. C помощью контекстного меню можно создавать элементы, удалять их. Чтобы открыть контекстное меню нажмите правой кнопкой мыши по рабочей области Canvas. Общее контекстное меню представлно на рисунке 1</p>
        <figure>
          <img src="@/assets/instruction/contextmenu/contextmenu_common.png" alt="The beautiful MDN logo.">
          <figcaption>Рисунок 1 - общее меню</figcaption>
        </figure>
      </li>
      <li>
        <p>
          При клике на пункт контекстного меню выполняется определенное действие
        </p>
      </li>
      <li>
        <p>
          Каждый объект на Canvas имеет свое собственное контекстное меню со своими вкладками. На рисунках 2-3 представлены контекстные меню элемента, стрелки.
        </p>
        <figure>
          <img src="@/assets/instruction/contextmenu/contextmenu_rect.png" alt="The beautiful MDN logo.">
          <figcaption>Рисунок 2 - меню элемента</figcaption>
        </figure>
        <figure>
          <img src="@/assets/instruction/contextmenu/contextmenu_arrow.png" alt="The beautiful MDN logo.">
          <figcaption>Рисунок 3 - меню стрелки</figcaption>
        </figure>
      </li>
      <li>
        <p>
          Чтобы убрать контекстное меню, нажмите по пустой рабочей области Canvas левой кнопкой мыши.
        </p>
      </li>
    </ol>

  </section>
    <section>
      <h2>
        Элементы
      </h2>
      <ol>
        <li>
          <p>
            Элементы - это объекты, которые состоят из разных частей: квадрата, розеток(сокетов). Они имеют свойсво соединяться друг с другом с помощью розеток. Образ элемента представлен на рисунке 4.
          </p>
          <figure>
            <img src="@/assets/instruction/contextmenu/element.png" alt="">
            <figcaption>Рисунок 4 - элемент</figcaption>
          </figure>
        </li>
        <li>
          <p>
            Элементы - содерэат от 1 до 4 розеток.
          </p>
        </li>
        <li>
          <p>
            Элементы - можно перемещать по экрану, добавлять, удалять.
          </p>
          <p>
            Для того переместить элемент, нужно зажать на него левой кнопкой мыши и перетащить в нужную Вам часть экрана.
          </p>
          <p>
            Для того, чтобы добавить элемент, Вам нужно вызвать общее контекстное меню и выбрать пункт "Добавить элемент"
          </p>
          <p>
            Для того, чтобы удалить элемент, Вам нужно вызвать контекстное меню самого элемента, представленное на рисунке 2, кликнув на него правой кнопкой мыши, и выбрать пункт "Удалить элемент"
          </p>
        </li>
      </ol>
    </section>
    <section>
      <h2>
        Розетки(сокеты)
      </h2>
      <ol>
        <li>
          <p>
            Розетки - это составляющие части элементов. Образ розетки представлен на рисунке 5.
          </p>
          <figure>
            <img src="@/assets/instruction/contextmenu/sockets.png" alt="">
            <figcaption>Рисунок 5 - сокет</figcaption>
          </figure>
        </li>
        <li>
          <p>
            Сокеты можно удалять из элемента, добавлять в него.
          </p>
          <p>
            Чтобы удалить сокет нужно вызвать контекстное меню элемента, в котором этот сокет находится и выбрать пункт "Удалить розетку...",  в зависимости от стороны элемента, на которой эта розтка находится.
            После удаления розетки, элемент разрывает связи со всеми стрелками, которые были подключены к данному сокету.
          </p>
          <p>
            Чтобы удалить сокет нужно вызвать контекстное меню элемента, в котором этот сокет находится и выбрать пункт "Добавить розетку...", в зависимости от стороны элемента, на которой вы хотите, чтобы эта розтка находилась.
          </p>
        </li>
        <li>
          <p>
            При перемещении элемента розетки перемещают все стрелки, подключенные к ним.
          </p>
        </li>

      </ol>
    </section>
    <section>
      <h2>
        Стрелки
      </h2>
      <ol>
        <li>
          <p>
            Стрелки - это соединиельные объекты, который соежтняют элементы 1 к 1 через их сокеты. Образ стрелки представлен на рисунке 6
          </p>
          <figure>
            <img src="@/assets/instruction/contextmenu/arrow.png" alt="">
            <figcaption>Рисунок 6 - стрелка</figcaption>
          </figure>
        </li>
        <li>
          <p>Стрелки состоят из несколько частей. Чтобы отделить одну часть от другой, на каждой части был добавлен кружок по центру. К тому же это добавляет удобство манипулирования стрелками</p>
          <p>Каждая часть стрелки может принимать лишь два направление "вертикальное" и "горизонтальное", и может только отображаться вдоль направлений координатных осей X и Y</p>
        </li>
        <li>
          <p>Стрелки можно удалять, добавлять, растягивать, соединять с сокетами, отсоединять от сокетов.</p>
          <p>Чтобы добавить стрелку необходимо вызвать общее контекстное меню, представленное на рисунке 1, и выбрать пункт "Добавить стрелку"</p>
          <p>Чтобы добавить стрелку необходимо вызвать контекстное меню стрелки, представленное на рисунке 3, нажав на нее правой кнопкой мыши, и выбрать пункт "Удалить стрелку". При удалении стрелка сообщает подключенному сокету об этом и в свою очередь сокет удаляет его из своего пула подключений</p>
          <p>Чтобы растянуть стрелку необходимо зажать левой кнопкой мыши на один из концов самой стрелки и перетащить в нужное Вам место</p>
          <p>Чтобы соеденить стрелку с сокетом необходимо проделать те же самые действия, что и при растягивании, только нужно перетащить конец стрелки на нужный Вам сокет элемента</p>
          <p>Чтобы отсоединить стрелку от сокета нужно перетащить один из концов стрелки в пустое место или на другой сокет</p>
        </li>
      </ol>
    </section>
  </div>
</div>
</template>

<script>
export default {
  name: "AboutPage"
}
</script>

<style scoped>
  .container{
    padding: 0 128px;
    margin: 32px 0;

  }
  .instruction{
    padding: 64px 0;
  }
  figure{
    text-align: center;
  }
  figure>img{
    border: 1px solid lightgray;
  }
</style>